Tekla Open API Reference for Tekla Structures 2025
ComponentCatalog Class
 The ComponentCatalog class represents a group of controls to select components using the component catalog.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.UserControl
 Tekla.Structures.Dialog.UIControls.ComponentCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ComponentCatalog : UserControl
Public Class ComponentCatalog
	Inherits UserControl
The ComponentCatalog type exposes the following members.
Constructors
Name | Description
ComponentCatalog
 Initializes a new instance of the ComponentCatalog class.
Top
Properties
Name | Description
SelectedComponentType
 Gets or sets the selected component type in the control.
SelectedName
 Gets or sets the selected component name in the control.
SelectedNumber
 Gets or sets the selected component number in the control.
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace